sdaiIsSDAISubtypeOfBN(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*,System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*,System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Determines whether a specified SDAI data type is a subtype of another SDAI data type (supertype).
\param schemaName [in] A string that contains the name of the schema.
\param subName    [in] A string that contains the name of the SDAI data type to be checked.
\param superName  [in] A string that contains the name of the supertype.
\returns sdaiTRUE if the specified SDAI data type is a subtype of the specified supertype; otherwise, the function returns sdaiFALSE.
\remarks
This function is not implemented yet.
Possible error codes:
* sdaiSS_NOPN - Session is not open.
* sdaiRP_NOPN - Repository is not open.
* sdaiED_NDEF - Entity definition not defined.
* sdaiED_NDEQ - Entity definition not domain equivalent.
* sdaiSD_NDEF - Schema definition not defined.
* sdaiFN_NAVL - Function not available.
* sdaiSY_ERR - Underlying system error.